cask_args appdir: '/Applications'

# Taps
tap 'crisidev/homebrew-chunkwm'

# Plugins
brew 'mas'

# Brew Apps
brew 'autojump'
brew 'bat'
brew 'ctags'
brew 'eslintd'
brew 'fzf'
brew 'git'
brew 'imagemagick'
brew 'neovim'
brew 'prettierd'
brew 'rbenv'
brew 'ripgrep'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'

# Cask Apps
cask 'clipy'
cask 'dropbox'
cask 'fig'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'git-credential-manager-core'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'visual-studio-code'

# Mac App Store Apps
mas 'bettersnaptool', id: 417375580
mas 'bitwarden',      id: 1352778147
mas 'slack',          id: 803453959
mas 'webcam-setting', id: 1610840452
