cask_args appdir: '/Applications'

# Taps
tap 'crisidev/homebrew-chunkwm'

# Plugins
brew 'mas'

# Brew Apps
brew 'autojump'
brew 'bat'
brew 'catimg'
brew 'ctags'
brew 'eslintd'
brew 'fzf'
brew 'git'
brew 'htop'
brew 'imagemagick'
brew 'iterm2'
brew 'jesseduffield/lazygit/lazygit'
brew 'jq'
brew 'lua-language-server'
brew 'neovim'
brew 'prettierd'
brew 'rbenv'
brew 'ripgrep'
brew 'socat'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'

# for git autocommit
brew 'coreutils'
brew 'fswatch'
brew 'gitwatch'

# Cask Apps
cask 'clipy'
cask 'dropbox'
cask 'fig'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'git-credential-manager-core'
cask 'google-chrome'
cask 'google-drive'
cask 'karabiner-elements'
cask 'obsidian'
cask 'syncthing'
cask 'visual-studio-code'

# Mac App Store Apps
mas 'bettersnaptool', id: 417375580
mas 'bitwarden',      id: 1352778147
mas 'slack',          id: 803453959
mas 'webcam-setting', id: 1610840452
