cask_args appdir: '/Applications'

# Taps
tap 'crisidev/homebrew-chunkwm'
tap 'fsouza/prettierd'
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap 'jesseduffield/lazygit'

# Plugins
brew 'mas'

# Brew Apps
brew 'autojump'
brew 'bat'
brew 'catimg'
brew 'ctags'
brew 'fsouza/prettierd/prettierd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'htop'
brew 'imagemagick'
brew 'jesseduffield/lazygit/lazygit'
brew 'jq'
brew 'lua-language-server'
brew 'neovim'
brew 'rbenv'
brew 'ripgrep'
brew 'socat'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'tree-sitter'

# for git autocommit
brew 'coreutils'
brew 'fswatch'
brew 'gitwatch'

# Cask Apps
cask 'clipy'
cask 'dropbox'
cask 'fig'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'karabiner-elements'
cask 'visual-studio-code'
cask 'ytmdesktop-youtube-music'

# Mac App Store Apps
mas 'bettersnaptool', id: 417375580
mas 'bitwarden',      id: 1352778147
mas 'slack',          id: 803453959
mas 'webcam-setting', id: 1610840452

# not available via Brew
# Packer
# git clone --depth 1 https://github.com/wbthomason/packer.nvim\ ~/.local/share/nvim/site/pack/packer/start/packer.nvim
#
# Cobalt2 Themes
# git clone git@github.com:wesbos/Cobalt2-iterm.git ~/.config/cobalt2
#
# NPM Global
# npm install -g eslint_d
